#!/bin/bash

##该脚本用来过滤中国移动认证的考试题题干，脚本中的文件IT.txt是过滤对象##
 
#a=$(cat IT.txt | grep -n 待检查 | awk -F ":" '{print $1}')

a=(2 16 30 44 58 72 86 100 114 128 142 156 170 184 198 212 226 240 254 268 282 296 310 324 338 352 366 380 394 408 422 436 450 464 478 492 506 520 534 548 562 576 590 604 618 632 646 660 674 688 702 716 730 744 758 772 786 800 814 828 842 856 870 884 898 912 926 940 954 968 982 996 1010 1024 1038 1052 1066 1080 1094 1108 1122 1133 1147 1161 1175 1189 1203 1217 1231 1245 1259 1273 1287 1301 1315 1329 1343 1357 1371 1385 1400 1414 1428 1442 1456 1470 1484 1498 1512 1529 1543 1557 1571 1585 1599 1613 1627 1641 1655 1669 1683 1697 1711 1725 1739 1753 1767 1784 1798 1812 1826 1840 1857 1871 1885 1899 1913 1927 1941 1955 1969 1983 1997 2011 2025 2039 2053 2067 2081 2101)

for (( i=0;i<150;i++ ))
do
    line1=${a[$i]}
    if [ $i -le 148 ];then
        line2=${a[$i+1]}
        sed -n "${line1},${line2}p" IT.txt | grep -v 待检查  > $i.txt
        line3=$(cat $i.txt | grep -n ^A | awk -F ":" '{print $1}' | head -n 1)
        line4=$(expr ${line3} - 1)
        sed -n "1,${line4}p" $i.txt   > ${i}-t.txt
    else
        line5=$(cat IT.txt | wc -l)
        line6=$(expr ${line5} + 1)
        sed -n "${line1},${line6}p" IT.txt |  grep -v 待检查  > ${i}.txt
        line7=$(cat $i.txt | grep -n ^A. | awk -F ":" '{print $1}' | head -n 1)
        line8=$(expr ${line7} - 1)
        sed -n "1,${line8}p" $i.txt   > ${i}-t.txt
    fi
done 

>it.txt
for i in $(seq 0 149)
do
    cat ${i}-t.txt >> it.txt
done
